# 演習課題「例外の種類を変更しよう その２」

# 右のコードでは、RPGの勇者の行動を3行表示します。
# しかし、未定義の変数number2を呼び出しているため例外が発生するのですが、補足する例外が異なるため、プログラムが強制終了してしまいます。
# このプログラムにレスキューブロックを追加して、未定義の変数を呼び出した場合の例外を補足してください。追加したブロックでは、標準エラー出力に下記のメッセージを表示してください。

# プログラムを実行して、想定どおり出力されれば演習課題クリアです！

# 期待する出力値
# 勇者は敵に遭遇した
# 勇者は勝利した

# 期待する標準エラー出力値
# 未定義の変数を呼び出しています

# 例外メッセージを指定しよう

begin
  enemies = ["スライム","ドラゴン","魔王"]
  number1 = 0

  puts "勇者は敵に遭遇した"
  puts "勇者は#{enemies[number2]}と戦った"
rescue ZeroDivisionError => e
  STDERR.puts "その敵は表示できません"
rescue NameError => e
  STDERR.puts "未定義の変数を呼び出しています"
ensure
  puts "勇者は勝利した"
end
